260209:1642 Update Infrastructure 3
